espressif/esp-idf/components/soc/esp32s31/register/soc/lp_gpio_reg.h
/** LP_GPIO_PIN7_REG register
 *  LP_GPIO7 configuration register
 */
#define LP_GPIO_PIN7_REG (DR_REG_LP_GPIO_BASE + 0x4c)
/** LP_GPIO_PIN7_SYNC2_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  Configures whether or not to synchronize LP_GPIO input data on either edge of LP IO
 *  MUX operating clock for the second-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define LP_GPIO_PIN7_SYNC2_BYPASS    0x00000003U
#define LP_GPIO_PIN7_SYNC2_BYPASS_M  (LP_GPIO_PIN7_SYNC2_BYPASS_V << LP_GPIO_PIN7_SYNC2_BYPASS_S)
#define LP_GPIO_PIN7_SYNC2_BYPASS_V  0x00000003U
#define LP_GPIO_PIN7_SYNC2_BYPASS_S  0
/** LP_GPIO_PIN7_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  Configures to select pin drive mode.
 *  0: Normal output
 *  1: Open drain output
 */
#define LP_GPIO_PIN7_PAD_DRIVER    (BIT(2))
#define LP_GPIO_PIN7_PAD_DRIVER_M  (LP_GPIO_PIN7_PAD_DRIVER_V << LP_GPIO_PIN7_PAD_DRIVER_S)
#define LP_GPIO_PIN7_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_PIN7_PAD_DRIVER_S  2
/** LP_GPIO_PIN7_SYNC1_BYPASS : R/W; bitpos: [4:3]; default: 0;
 *  Configures whether or not to synchronize LP_GPIO input data on either edge of LP IO
 *  MUX operating clock for the first-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define LP_GPIO_PIN7_SYNC1_BYPASS    0x00000003U
#define LP_GPIO_PIN7_SYNC1_BYPASS_M  (LP_GPIO_PIN7_SYNC1_BYPASS_V << LP_GPIO_PIN7_SYNC1_BYPASS_S)
#define LP_GPIO_PIN7_SYNC1_BYPASS_V  0x00000003U
#define LP_GPIO_PIN7_SYNC1_BYPASS_S  3
/** LP_GPIO_PIN7_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  LP_GPIO wakeup clear register.
 */
#define LP_GPIO_PIN7_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_PIN7_EDGE_WAKEUP_CLR_M  (LP_GPIO_PIN7_EDGE_WAKEUP_CLR_V << LP_GPIO_PIN7_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_PIN7_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_PIN7_EDGE_WAKEUP_CLR_S  5
/** LP_GPIO_PIN7_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  Configures LP_GPIO interrupt type.
 *  0: LP_GPIO interrupt disabled
 *  1: Rising edge trigger
 *  2: Falling edge trigger
 *  3: Any edge trigger
 *  4: Low level trigger
 *  5: High level trigger
 */
#define LP_GPIO_PIN7_INT_TYPE    0x00000007U
#define LP_GPIO_PIN7_INT_TYPE_M  (LP_GPIO_PIN7_INT_TYPE_V << LP_GPIO_PIN7_INT_TYPE_S)
#define LP_GPIO_PIN7_INT_TYPE_V  0x00000007U
#define LP_GPIO_PIN7_INT_TYPE_S  7
/** LP_GPIO_PIN7_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  Configures whether or not to enable LP_GPIO wake-up function.
 *  0: Disable
 *  1: Enable
 *  This function only wakes up the CPU from Light-sleep.
 */
#define LP_GPIO_PIN7_WAKEUP_ENABLE    (BIT(10))
#define LP_GPIO_PIN7_WAKEUP_ENABLE_M  (LP_GPIO_PIN7_WAKEUP_ENABLE_V << LP_GPIO_PIN7_WAKEUP_ENABLE_S)
#define LP_GPIO_PIN7_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_PIN7_WAKEUP_ENABLE_S  10

/** LP_GPIO_FUNC0_IN_SEL_CFG_REG register
 *  Configuration register for input signal 0
 */
#define LP_GPIO_FUNC0_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xb0)
/** LP_GPIO_FUNC0_IN_SEL : R/W; bitpos: [3:0]; default: 8;
 *  Configures to select a pin from the 8 LP_GPIO pins to connect the input signal 0.
 *  0: Select LP_GPIO0
 *  1: Select LP_GPIO1
 *  ......
 *  6: Select LP_GPIO6
 *  7: Select LP_GPIO7
 *  Or
 *  0x8: A constantly high input
 *  0xc: A constantly low input
 */
#define LP_GPIO_FUNC0_IN_SEL    0x0000000FU
#define LP_GPIO_FUNC0_IN_SEL_M  (LP_GPIO_FUNC0_IN_SEL_V << LP_GPIO_FUNC0_IN_SEL_S)
#define LP_GPIO_FUNC0_IN_SEL_V  0x0000000FU
#define LP_GPIO_FUNC0_IN_SEL_S  0
/** LP_GPIO_FUNC0_IN_INV_SEL : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC0_IN_INV_SEL    (BIT(4))
#define LP_GPIO_FUNC0_IN_INV_SEL_M  (LP_GPIO_FUNC0_IN_INV_SEL_V << LP_GPIO_FUNC0_IN_INV_SEL_S)
#define LP_GPIO_FUNC0_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC0_IN_INV_SEL_S  4
/** LP_GPIO_SIG0_IN_SEL : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to route signals via LP_GPIO matrix.
 *  0: Bypass LP_GPIO matrix, i.e., connect signals directly to peripheral configured
 *  in IO MUX.
 *  1: Route signals via LP_GPIO matrix.
 */
#define LP_GPIO_SIG0_IN_SEL    (BIT(5))
#define LP_GPIO_SIG0_IN_SEL_M  (LP_GPIO_SIG0_IN_SEL_V << LP_GPIO_SIG0_IN_SEL_S)
#define LP_GPIO_SIG0_IN_SEL_V  0x00000001U
#define LP_GPIO_SIG0_IN_SEL_S  5

/** LP_GPIO_FUNC1_IN_SEL_CFG_REG register
 *  Configuration register for input signal 1
 */
#define LP_GPIO_FUNC1_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xb4)
/** LP_GPIO_FUNC1_IN_SEL : R/W; bitpos: [3:0]; default: 8;
 *  Configures to select a pin from the 8 LP_GPIO pins to connect the input signal 1.
 *  0: Select LP_GPIO0
 *  1: Select LP_GPIO1
 *  ......
 *  6: Select LP_GPIO6
 *  7: Select LP_GPIO7
 *  Or
 *  0x8: A constantly high input
 *  0xc: A constantly low input
 */
#define LP_GPIO_FUNC1_IN_SEL    0x0000000FU
#define LP_GPIO_FUNC1_IN_SEL_M  (LP_GPIO_FUNC1_IN_SEL_V << LP_GPIO_FUNC1_IN_SEL_S)
#define LP_GPIO_FUNC1_IN_SEL_V  0x0000000FU
#define LP_GPIO_FUNC1_IN_SEL_S  0
/** LP_GPIO_FUNC1_IN_INV_SEL : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC1_IN_INV_SEL    (BIT(4))
#define LP_GPIO_FUNC1_IN_INV_SEL_M  (LP_GPIO_FUNC1_IN_INV_SEL_V << LP_GPIO_FUNC1_IN_INV_SEL_S)
#define LP_GPIO_FUNC1_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC1_IN_INV_SEL_S  4
/** LP_GPIO_SIG1_IN_SEL : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to route signals via LP_GPIO matrix.
 *  0: Bypass LP_GPIO matrix, i.e., connect signals directly to peripheral configured
 *  in IO MUX.
 *  1: Route signals via LP_GPIO matrix.
 */
#define LP_GPIO_SIG1_IN_SEL    (BIT(5))
#define LP_GPIO_SIG1_IN_SEL_M  (LP_GPIO_SIG1_IN_SEL_V << LP_GPIO_SIG1_IN_SEL_S)
#define LP_GPIO_SIG1_IN_SEL_V  0x00000001U
#define LP_GPIO_SIG1_IN_SEL_S  5

/** LP_GPIO_FUNC2_IN_SEL_CFG_REG register
 *  Configuration register for input signal 2
 */
#define LP_GPIO_FUNC2_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xb8)
/** LP_GPIO_FUNC2_IN_SEL : R/W; bitpos: [3:0]; default: 8;
 *  Configures to select a pin from the 8 LP_GPIO pins to connect the input signal 2.
 *  0: Select LP_GPIO0
 *  1: Select LP_GPIO1
 *  ......
 *  6: Select LP_GPIO6
 *  7: Select LP_GPIO7
 *  Or
 *  0x8: A constantly high input
 *  0xc: A constantly low input
 */
#define LP_GPIO_FUNC2_IN_SEL    0x0000000FU
#define LP_GPIO_FUNC2_IN_SEL_M  (LP_GPIO_FUNC2_IN_SEL_V << LP_GPIO_FUNC2_IN_SEL_S)
#define LP_GPIO_FUNC2_IN_SEL_V  0x0000000FU
#define LP_GPIO_FUNC2_IN_SEL_S  0
/** LP_GPIO_FUNC2_IN_INV_SEL : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC2_IN_INV_SEL    (BIT(4))
#define LP_GPIO_FUNC2_IN_INV_SEL_M  (LP_GPIO_FUNC2_IN_INV_SEL_V << LP_GPIO_FUNC2_IN_INV_SEL_S)
#define LP_GPIO_FUNC2_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC2_IN_INV_SEL_S  4
/** LP_GPIO_SIG2_IN_SEL : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to route signals via LP_GPIO matrix.
 *  0: Bypass LP_GPIO matrix, i.e., connect signals directly to peripheral configured
 *  in IO MUX.
 *  1: Route signals via LP_GPIO matrix.
 */
#define LP_GPIO_SIG2_IN_SEL    (BIT(5))
#define LP_GPIO_SIG2_IN_SEL_M  (LP_GPIO_SIG2_IN_SEL_V << LP_GPIO_SIG2_IN_SEL_S)
#define LP_GPIO_SIG2_IN_SEL_V  0x00000001U
#define LP_GPIO_SIG2_IN_SEL_S  5

