espressif/esp-idf/components/soc/esp32s31/register/soc/lp_gpio_reg.h
/** LP_GPIO_FUNC3_IN_SEL_CFG_REG register
 *  Configuration register for input signal 3
 */
#define LP_GPIO_FUNC3_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xbc)
/** LP_GPIO_FUNC3_IN_SEL : R/W; bitpos: [3:0]; default: 8;
 *  Configures to select a pin from the 8 LP_GPIO pins to connect the input signal 3.
 *  0: Select LP_GPIO0
 *  1: Select LP_GPIO1
 *  ......
 *  6: Select LP_GPIO6
 *  7: Select LP_GPIO7
 *  Or
 *  0x8: A constantly high input
 *  0xc: A constantly low input
 */
#define LP_GPIO_FUNC3_IN_SEL    0x0000000FU
#define LP_GPIO_FUNC3_IN_SEL_M  (LP_GPIO_FUNC3_IN_SEL_V << LP_GPIO_FUNC3_IN_SEL_S)
#define LP_GPIO_FUNC3_IN_SEL_V  0x0000000FU
#define LP_GPIO_FUNC3_IN_SEL_S  0
/** LP_GPIO_FUNC3_IN_INV_SEL : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC3_IN_INV_SEL    (BIT(4))
#define LP_GPIO_FUNC3_IN_INV_SEL_M  (LP_GPIO_FUNC3_IN_INV_SEL_V << LP_GPIO_FUNC3_IN_INV_SEL_S)
#define LP_GPIO_FUNC3_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC3_IN_INV_SEL_S  4
/** LP_GPIO_SIG3_IN_SEL : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to route signals via LP_GPIO matrix.
 *  0: Bypass LP_GPIO matrix, i.e., connect signals directly to peripheral configured
 *  in IO MUX.
 *  1: Route signals via LP_GPIO matrix.
 */
#define LP_GPIO_SIG3_IN_SEL    (BIT(5))
#define LP_GPIO_SIG3_IN_SEL_M  (LP_GPIO_SIG3_IN_SEL_V << LP_GPIO_SIG3_IN_SEL_S)
#define LP_GPIO_SIG3_IN_SEL_V  0x00000001U
#define LP_GPIO_SIG3_IN_SEL_S  5

/** LP_GPIO_FUNC4_IN_SEL_CFG_REG register
 *  Configuration register for input signal 4
 */
#define LP_GPIO_FUNC4_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xc0)
/** LP_GPIO_FUNC4_IN_SEL : R/W; bitpos: [3:0]; default: 8;
 *  Configures to select a pin from the 8 LP_GPIO pins to connect the input signal 4.
 *  0: Select LP_GPIO0
 *  1: Select LP_GPIO1
 *  ......
 *  6: Select LP_GPIO6
 *  7: Select LP_GPIO7
 *  Or
 *  0x8: A constantly high input
 *  0xc: A constantly low input
 */
#define LP_GPIO_FUNC4_IN_SEL    0x0000000FU
#define LP_GPIO_FUNC4_IN_SEL_M  (LP_GPIO_FUNC4_IN_SEL_V << LP_GPIO_FUNC4_IN_SEL_S)
#define LP_GPIO_FUNC4_IN_SEL_V  0x0000000FU
#define LP_GPIO_FUNC4_IN_SEL_S  0
/** LP_GPIO_FUNC4_IN_INV_SEL : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC4_IN_INV_SEL    (BIT(4))
#define LP_GPIO_FUNC4_IN_INV_SEL_M  (LP_GPIO_FUNC4_IN_INV_SEL_V << LP_GPIO_FUNC4_IN_INV_SEL_S)
#define LP_GPIO_FUNC4_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC4_IN_INV_SEL_S  4
/** LP_GPIO_SIG4_IN_SEL : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to route signals via LP_GPIO matrix.
 *  0: Bypass LP_GPIO matrix, i.e., connect signals directly to peripheral configured
 *  in IO MUX.
 *  1: Route signals via LP_GPIO matrix.
 */
#define LP_GPIO_SIG4_IN_SEL    (BIT(5))
#define LP_GPIO_SIG4_IN_SEL_M  (LP_GPIO_SIG4_IN_SEL_V << LP_GPIO_SIG4_IN_SEL_S)
#define LP_GPIO_SIG4_IN_SEL_V  0x00000001U
#define LP_GPIO_SIG4_IN_SEL_S  5

/** LP_GPIO_FUNC5_IN_SEL_CFG_REG register
 *  Configuration register for input signal 5
 */
#define LP_GPIO_FUNC5_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xc4)
/** LP_GPIO_FUNC5_IN_SEL : R/W; bitpos: [3:0]; default: 8;
 *  Configures to select a pin from the 8 LP_GPIO pins to connect the input signal 5.
 *  0: Select LP_GPIO0
 *  1: Select LP_GPIO1
 *  ......
 *  6: Select LP_GPIO6
 *  7: Select LP_GPIO7
 *  Or
 *  0x8: A constantly high input
 *  0xc: A constantly low input
 */
#define LP_GPIO_FUNC5_IN_SEL    0x0000000FU
#define LP_GPIO_FUNC5_IN_SEL_M  (LP_GPIO_FUNC5_IN_SEL_V << LP_GPIO_FUNC5_IN_SEL_S)
#define LP_GPIO_FUNC5_IN_SEL_V  0x0000000FU
#define LP_GPIO_FUNC5_IN_SEL_S  0
/** LP_GPIO_FUNC5_IN_INV_SEL : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC5_IN_INV_SEL    (BIT(4))
#define LP_GPIO_FUNC5_IN_INV_SEL_M  (LP_GPIO_FUNC5_IN_INV_SEL_V << LP_GPIO_FUNC5_IN_INV_SEL_S)
#define LP_GPIO_FUNC5_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC5_IN_INV_SEL_S  4
/** LP_GPIO_SIG5_IN_SEL : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to route signals via LP_GPIO matrix.
 *  0: Bypass LP_GPIO matrix, i.e., connect signals directly to peripheral configured
 *  in IO MUX.
 *  1: Route signals via LP_GPIO matrix.
 */
#define LP_GPIO_SIG5_IN_SEL    (BIT(5))
#define LP_GPIO_SIG5_IN_SEL_M  (LP_GPIO_SIG5_IN_SEL_V << LP_GPIO_SIG5_IN_SEL_S)
#define LP_GPIO_SIG5_IN_SEL_V  0x00000001U
#define LP_GPIO_SIG5_IN_SEL_S  5

/** LP_GPIO_FUNC6_IN_SEL_CFG_REG register
 *  Configuration register for input signal 6
 */
#define LP_GPIO_FUNC6_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xc8)
/** LP_GPIO_FUNC6_IN_SEL : R/W; bitpos: [3:0]; default: 8;
 *  Configures to select a pin from the 8 LP_GPIO pins to connect the input signal 6.
 *  0: Select LP_GPIO0
 *  1: Select LP_GPIO1
 *  ......
 *  6: Select LP_GPIO6
 *  7: Select LP_GPIO7
 *  Or
 *  0x8: A constantly high input
 *  0xc: A constantly low input
 */
#define LP_GPIO_FUNC6_IN_SEL    0x0000000FU
#define LP_GPIO_FUNC6_IN_SEL_M  (LP_GPIO_FUNC6_IN_SEL_V << LP_GPIO_FUNC6_IN_SEL_S)
#define LP_GPIO_FUNC6_IN_SEL_V  0x0000000FU
#define LP_GPIO_FUNC6_IN_SEL_S  0
/** LP_GPIO_FUNC6_IN_INV_SEL : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC6_IN_INV_SEL    (BIT(4))
#define LP_GPIO_FUNC6_IN_INV_SEL_M  (LP_GPIO_FUNC6_IN_INV_SEL_V << LP_GPIO_FUNC6_IN_INV_SEL_S)
#define LP_GPIO_FUNC6_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC6_IN_INV_SEL_S  4
/** LP_GPIO_SIG6_IN_SEL : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to route signals via LP_GPIO matrix.
 *  0: Bypass LP_GPIO matrix, i.e., connect signals directly to peripheral configured
 *  in IO MUX.
 *  1: Route signals via LP_GPIO matrix.
 */
#define LP_GPIO_SIG6_IN_SEL    (BIT(5))
#define LP_GPIO_SIG6_IN_SEL_M  (LP_GPIO_SIG6_IN_SEL_V << LP_GPIO_SIG6_IN_SEL_S)
#define LP_GPIO_SIG6_IN_SEL_V  0x00000001U
#define LP_GPIO_SIG6_IN_SEL_S  5

/** LP_GPIO_FUNC7_IN_SEL_CFG_REG register
 *  Configuration register for input signal 7
 */
#define LP_GPIO_FUNC7_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xcc)
/** LP_GPIO_FUNC7_IN_SEL : R/W; bitpos: [3:0]; default: 8;
 *  Configures to select a pin from the 8 LP_GPIO pins to connect the input signal 7.
 *  0: Select LP_GPIO0
 *  1: Select LP_GPIO1
 *  ......
 *  6: Select LP_GPIO6
 *  7: Select LP_GPIO7
 *  Or
 *  0x8: A constantly high input
 *  0xc: A constantly low input
 */
#define LP_GPIO_FUNC7_IN_SEL    0x0000000FU
#define LP_GPIO_FUNC7_IN_SEL_M  (LP_GPIO_FUNC7_IN_SEL_V << LP_GPIO_FUNC7_IN_SEL_S)
#define LP_GPIO_FUNC7_IN_SEL_V  0x0000000FU
#define LP_GPIO_FUNC7_IN_SEL_S  0
/** LP_GPIO_FUNC7_IN_INV_SEL : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC7_IN_INV_SEL    (BIT(4))
#define LP_GPIO_FUNC7_IN_INV_SEL_M  (LP_GPIO_FUNC7_IN_INV_SEL_V << LP_GPIO_FUNC7_IN_INV_SEL_S)
#define LP_GPIO_FUNC7_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC7_IN_INV_SEL_S  4
/** LP_GPIO_SIG7_IN_SEL : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to route signals via LP_GPIO matrix.
 *  0: Bypass LP_GPIO matrix, i.e., connect signals directly to peripheral configured
 *  in IO MUX.
 *  1: Route signals via LP_GPIO matrix.
 */
#define LP_GPIO_SIG7_IN_SEL    (BIT(5))
#define LP_GPIO_SIG7_IN_SEL_M  (LP_GPIO_SIG7_IN_SEL_V << LP_GPIO_SIG7_IN_SEL_S)
#define LP_GPIO_SIG7_IN_SEL_V  0x00000001U
#define LP_GPIO_SIG7_IN_SEL_S  5

