espressif/esp-idf/components/soc/esp32s31/register/soc/lp_gpio_reg.h
/** LP_GPIO_FUNC8_IN_SEL_CFG_REG register
 *  Configuration register for input signal 8
 */
#define LP_GPIO_FUNC8_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xd0)
/** LP_GPIO_FUNC8_IN_SEL : R/W; bitpos: [3:0]; default: 8;
 *  Configures to select a pin from the 8 LP_GPIO pins to connect the input signal 8.
 *  0: Select LP_GPIO0
 *  1: Select LP_GPIO1
 *  ......
 *  6: Select LP_GPIO6
 *  7: Select LP_GPIO7
 *  Or
 *  0x8: A constantly high input
 *  0xc: A constantly low input
 */
#define LP_GPIO_FUNC8_IN_SEL    0x0000000FU
#define LP_GPIO_FUNC8_IN_SEL_M  (LP_GPIO_FUNC8_IN_SEL_V << LP_GPIO_FUNC8_IN_SEL_S)
#define LP_GPIO_FUNC8_IN_SEL_V  0x0000000FU
#define LP_GPIO_FUNC8_IN_SEL_S  0
/** LP_GPIO_FUNC8_IN_INV_SEL : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC8_IN_INV_SEL    (BIT(4))
#define LP_GPIO_FUNC8_IN_INV_SEL_M  (LP_GPIO_FUNC8_IN_INV_SEL_V << LP_GPIO_FUNC8_IN_INV_SEL_S)
#define LP_GPIO_FUNC8_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC8_IN_INV_SEL_S  4
/** LP_GPIO_SIG8_IN_SEL : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to route signals via LP_GPIO matrix.
 *  0: Bypass LP_GPIO matrix, i.e., connect signals directly to peripheral configured
 *  in IO MUX.
 *  1: Route signals via LP_GPIO matrix.
 */
#define LP_GPIO_SIG8_IN_SEL    (BIT(5))
#define LP_GPIO_SIG8_IN_SEL_M  (LP_GPIO_SIG8_IN_SEL_V << LP_GPIO_SIG8_IN_SEL_S)
#define LP_GPIO_SIG8_IN_SEL_V  0x00000001U
#define LP_GPIO_SIG8_IN_SEL_S  5

/** LP_GPIO_FUNC0_OUT_SEL_CFG_REG register
 *  Configuration register for LP_GPIO0 output
 */
#define LP_GPIO_FUNC0_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2b0)
/** LP_GPIO_FUNC0_OUT_SEL : R/W; bitpos: [5:0]; default: 32;
 *  Configures to select a signal $Y (0 <= $Y < 32) from 32 peripheral signals to be
 *  output from LP_GPIO0.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  30: Select signal 30
 *  31: Select signal 31
 *  Or
 *  32: Bit 0 of LP_GPIO_OUT_REG and LP_GPIO_ENABLE_REG are selected as the output
 *  value and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define LP_GPIO_FUNC0_OUT_SEL    0x0000003FU
#define LP_GPIO_FUNC0_OUT_SEL_M  (LP_GPIO_FUNC0_OUT_SEL_V << LP_GPIO_FUNC0_OUT_SEL_S)
#define LP_GPIO_FUNC0_OUT_SEL_V  0x0000003FU
#define LP_GPIO_FUNC0_OUT_SEL_S  0
/** LP_GPIO_FUNC0_OUT_INV_SEL : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC0_OUT_INV_SEL    (BIT(6))
#define LP_GPIO_FUNC0_OUT_INV_SEL_M  (LP_GPIO_FUNC0_OUT_INV_SEL_V << LP_GPIO_FUNC0_OUT_INV_SEL_S)
#define LP_GPIO_FUNC0_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC0_OUT_INV_SEL_S  6
/** LP_GPIO_FUNC0_OE_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 0 of LP_GPIO_ENABLE_REG.
 */
#define LP_GPIO_FUNC0_OE_SEL    (BIT(7))
#define LP_GPIO_FUNC0_OE_SEL_M  (LP_GPIO_FUNC0_OE_SEL_V << LP_GPIO_FUNC0_OE_SEL_S)
#define LP_GPIO_FUNC0_OE_SEL_V  0x00000001U
#define LP_GPIO_FUNC0_OE_SEL_S  7
/** LP_GPIO_FUNC0_OE_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC0_OE_INV_SEL    (BIT(8))
#define LP_GPIO_FUNC0_OE_INV_SEL_M  (LP_GPIO_FUNC0_OE_INV_SEL_V << LP_GPIO_FUNC0_OE_INV_SEL_S)
#define LP_GPIO_FUNC0_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC0_OE_INV_SEL_S  8

/** LP_GPIO_FUNC1_OUT_SEL_CFG_REG register
 *  Configuration register for LP_GPIO1 output
 */
#define LP_GPIO_FUNC1_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2b4)
/** LP_GPIO_FUNC1_OUT_SEL : R/W; bitpos: [5:0]; default: 32;
 *  Configures to select a signal $Y (0 <= $Y < 32) from 32 peripheral signals to be
 *  output from LP_GPIO1.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  30: Select signal 30
 *  31: Select signal 31
 *  Or
 *  32: Bit 1 of LP_GPIO_OUT_REG and LP_GPIO_ENABLE_REG are selected as the output
 *  value and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define LP_GPIO_FUNC1_OUT_SEL    0x0000003FU
#define LP_GPIO_FUNC1_OUT_SEL_M  (LP_GPIO_FUNC1_OUT_SEL_V << LP_GPIO_FUNC1_OUT_SEL_S)
#define LP_GPIO_FUNC1_OUT_SEL_V  0x0000003FU
#define LP_GPIO_FUNC1_OUT_SEL_S  0
/** LP_GPIO_FUNC1_OUT_INV_SEL : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC1_OUT_INV_SEL    (BIT(6))
#define LP_GPIO_FUNC1_OUT_INV_SEL_M  (LP_GPIO_FUNC1_OUT_INV_SEL_V << LP_GPIO_FUNC1_OUT_INV_SEL_S)
#define LP_GPIO_FUNC1_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC1_OUT_INV_SEL_S  6
/** LP_GPIO_FUNC1_OE_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 1 of LP_GPIO_ENABLE_REG.
 */
#define LP_GPIO_FUNC1_OE_SEL    (BIT(7))
#define LP_GPIO_FUNC1_OE_SEL_M  (LP_GPIO_FUNC1_OE_SEL_V << LP_GPIO_FUNC1_OE_SEL_S)
#define LP_GPIO_FUNC1_OE_SEL_V  0x00000001U
#define LP_GPIO_FUNC1_OE_SEL_S  7
/** LP_GPIO_FUNC1_OE_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC1_OE_INV_SEL    (BIT(8))
#define LP_GPIO_FUNC1_OE_INV_SEL_M  (LP_GPIO_FUNC1_OE_INV_SEL_V << LP_GPIO_FUNC1_OE_INV_SEL_S)
#define LP_GPIO_FUNC1_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC1_OE_INV_SEL_S  8

/** LP_GPIO_FUNC2_OUT_SEL_CFG_REG register
 *  Configuration register for LP_GPIO2 output
 */
#define LP_GPIO_FUNC2_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2b8)
/** LP_GPIO_FUNC2_OUT_SEL : R/W; bitpos: [5:0]; default: 32;
 *  Configures to select a signal $Y (0 <= $Y < 32) from 32 peripheral signals to be
 *  output from LP_GPIO2.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  30: Select signal 30
 *  31: Select signal 31
 *  Or
 *  32: Bit 2 of LP_GPIO_OUT_REG and LP_GPIO_ENABLE_REG are selected as the output
 *  value and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define LP_GPIO_FUNC2_OUT_SEL    0x0000003FU
#define LP_GPIO_FUNC2_OUT_SEL_M  (LP_GPIO_FUNC2_OUT_SEL_V << LP_GPIO_FUNC2_OUT_SEL_S)
#define LP_GPIO_FUNC2_OUT_SEL_V  0x0000003FU
#define LP_GPIO_FUNC2_OUT_SEL_S  0
/** LP_GPIO_FUNC2_OUT_INV_SEL : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC2_OUT_INV_SEL    (BIT(6))
#define LP_GPIO_FUNC2_OUT_INV_SEL_M  (LP_GPIO_FUNC2_OUT_INV_SEL_V << LP_GPIO_FUNC2_OUT_INV_SEL_S)
#define LP_GPIO_FUNC2_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC2_OUT_INV_SEL_S  6
/** LP_GPIO_FUNC2_OE_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 2 of LP_GPIO_ENABLE_REG.
 */
#define LP_GPIO_FUNC2_OE_SEL    (BIT(7))
#define LP_GPIO_FUNC2_OE_SEL_M  (LP_GPIO_FUNC2_OE_SEL_V << LP_GPIO_FUNC2_OE_SEL_S)
#define LP_GPIO_FUNC2_OE_SEL_V  0x00000001U
#define LP_GPIO_FUNC2_OE_SEL_S  7
/** LP_GPIO_FUNC2_OE_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC2_OE_INV_SEL    (BIT(8))
#define LP_GPIO_FUNC2_OE_INV_SEL_M  (LP_GPIO_FUNC2_OE_INV_SEL_V << LP_GPIO_FUNC2_OE_INV_SEL_S)
#define LP_GPIO_FUNC2_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC2_OE_INV_SEL_S  8

/** LP_GPIO_FUNC3_OUT_SEL_CFG_REG register
 *  Configuration register for LP_GPIO3 output
 */
#define LP_GPIO_FUNC3_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2bc)
/** LP_GPIO_FUNC3_OUT_SEL : R/W; bitpos: [5:0]; default: 32;
 *  Configures to select a signal $Y (0 <= $Y < 32) from 32 peripheral signals to be
 *  output from LP_GPIO3.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  30: Select signal 30
 *  31: Select signal 31
 *  Or
 *  32: Bit 3 of LP_GPIO_OUT_REG and LP_GPIO_ENABLE_REG are selected as the output
 *  value and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define LP_GPIO_FUNC3_OUT_SEL    0x0000003FU
#define LP_GPIO_FUNC3_OUT_SEL_M  (LP_GPIO_FUNC3_OUT_SEL_V << LP_GPIO_FUNC3_OUT_SEL_S)
#define LP_GPIO_FUNC3_OUT_SEL_V  0x0000003FU
#define LP_GPIO_FUNC3_OUT_SEL_S  0
/** LP_GPIO_FUNC3_OUT_INV_SEL : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC3_OUT_INV_SEL    (BIT(6))
#define LP_GPIO_FUNC3_OUT_INV_SEL_M  (LP_GPIO_FUNC3_OUT_INV_SEL_V << LP_GPIO_FUNC3_OUT_INV_SEL_S)
#define LP_GPIO_FUNC3_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC3_OUT_INV_SEL_S  6
/** LP_GPIO_FUNC3_OE_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 3 of LP_GPIO_ENABLE_REG.
 */
#define LP_GPIO_FUNC3_OE_SEL    (BIT(7))
#define LP_GPIO_FUNC3_OE_SEL_M  (LP_GPIO_FUNC3_OE_SEL_V << LP_GPIO_FUNC3_OE_SEL_S)
#define LP_GPIO_FUNC3_OE_SEL_V  0x00000001U
#define LP_GPIO_FUNC3_OE_SEL_S  7
/** LP_GPIO_FUNC3_OE_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC3_OE_INV_SEL    (BIT(8))
#define LP_GPIO_FUNC3_OE_INV_SEL_M  (LP_GPIO_FUNC3_OE_INV_SEL_V << LP_GPIO_FUNC3_OE_INV_SEL_S)
#define LP_GPIO_FUNC3_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC3_OE_INV_SEL_S  8

/** LP_GPIO_FUNC4_OUT_SEL_CFG_REG register
 *  Configuration register for LP_GPIO4 output
 */
#define LP_GPIO_FUNC4_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2c0)
/** LP_GPIO_FUNC4_OUT_SEL : R/W; bitpos: [5:0]; default: 32;
 *  Configures to select a signal $Y (0 <= $Y < 32) from 32 peripheral signals to be
 *  output from LP_GPIO4.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  30: Select signal 30
 *  31: Select signal 31
 *  Or
 *  32: Bit 4 of LP_GPIO_OUT_REG and LP_GPIO_ENABLE_REG are selected as the output
 *  value and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define LP_GPIO_FUNC4_OUT_SEL    0x0000003FU
#define LP_GPIO_FUNC4_OUT_SEL_M  (LP_GPIO_FUNC4_OUT_SEL_V << LP_GPIO_FUNC4_OUT_SEL_S)
#define LP_GPIO_FUNC4_OUT_SEL_V  0x0000003FU
#define LP_GPIO_FUNC4_OUT_SEL_S  0
/** LP_GPIO_FUNC4_OUT_INV_SEL : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC4_OUT_INV_SEL    (BIT(6))
#define LP_GPIO_FUNC4_OUT_INV_SEL_M  (LP_GPIO_FUNC4_OUT_INV_SEL_V << LP_GPIO_FUNC4_OUT_INV_SEL_S)
#define LP_GPIO_FUNC4_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC4_OUT_INV_SEL_S  6
/** LP_GPIO_FUNC4_OE_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 4 of LP_GPIO_ENABLE_REG.
 */
#define LP_GPIO_FUNC4_OE_SEL    (BIT(7))
#define LP_GPIO_FUNC4_OE_SEL_M  (LP_GPIO_FUNC4_OE_SEL_V << LP_GPIO_FUNC4_OE_SEL_S)
#define LP_GPIO_FUNC4_OE_SEL_V  0x00000001U
#define LP_GPIO_FUNC4_OE_SEL_S  7
/** LP_GPIO_FUNC4_OE_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC4_OE_INV_SEL    (BIT(8))
#define LP_GPIO_FUNC4_OE_INV_SEL_M  (LP_GPIO_FUNC4_OE_INV_SEL_V << LP_GPIO_FUNC4_OE_INV_SEL_S)
#define LP_GPIO_FUNC4_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC4_OE_INV_SEL_S  8

/** LP_GPIO_FUNC5_OUT_SEL_CFG_REG register
 *  Configuration register for LP_GPIO5 output
 */
#define LP_GPIO_FUNC5_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2c4)
/** LP_GPIO_FUNC5_OUT_SEL : R/W; bitpos: [5:0]; default: 32;
 *  Configures to select a signal $Y (0 <= $Y < 32) from 32 peripheral signals to be
 *  output from LP_GPIO5.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  30: Select signal 30
 *  31: Select signal 31
 *  Or
 *  32: Bit 5 of LP_GPIO_OUT_REG and LP_GPIO_ENABLE_REG are selected as the output
 *  value and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define LP_GPIO_FUNC5_OUT_SEL    0x0000003FU
#define LP_GPIO_FUNC5_OUT_SEL_M  (LP_GPIO_FUNC5_OUT_SEL_V << LP_GPIO_FUNC5_OUT_SEL_S)
#define LP_GPIO_FUNC5_OUT_SEL_V  0x0000003FU
#define LP_GPIO_FUNC5_OUT_SEL_S  0
/** LP_GPIO_FUNC5_OUT_INV_SEL : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC5_OUT_INV_SEL    (BIT(6))
#define LP_GPIO_FUNC5_OUT_INV_SEL_M  (LP_GPIO_FUNC5_OUT_INV_SEL_V << LP_GPIO_FUNC5_OUT_INV_SEL_S)
#define LP_GPIO_FUNC5_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC5_OUT_INV_SEL_S  6
/** LP_GPIO_FUNC5_OE_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 5 of LP_GPIO_ENABLE_REG.
 */
#define LP_GPIO_FUNC5_OE_SEL    (BIT(7))
#define LP_GPIO_FUNC5_OE_SEL_M  (LP_GPIO_FUNC5_OE_SEL_V << LP_GPIO_FUNC5_OE_SEL_S)
#define LP_GPIO_FUNC5_OE_SEL_V  0x00000001U
#define LP_GPIO_FUNC5_OE_SEL_S  7
/** LP_GPIO_FUNC5_OE_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC5_OE_INV_SEL    (BIT(8))
#define LP_GPIO_FUNC5_OE_INV_SEL_M  (LP_GPIO_FUNC5_OE_INV_SEL_V << LP_GPIO_FUNC5_OE_INV_SEL_S)
#define LP_GPIO_FUNC5_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC5_OE_INV_SEL_S  8

/** LP_GPIO_FUNC6_OUT_SEL_CFG_REG register
 *  Configuration register for LP_GPIO6 output
 */
#define LP_GPIO_FUNC6_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2c8)
/** LP_GPIO_FUNC6_OUT_SEL : R/W; bitpos: [5:0]; default: 32;
 *  Configures to select a signal $Y (0 <= $Y < 32) from 32 peripheral signals to be
 *  output from LP_GPIO6.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  30: Select signal 30
 *  31: Select signal 31
 *  Or
 *  32: Bit 6 of LP_GPIO_OUT_REG and LP_GPIO_ENABLE_REG are selected as the output
 *  value and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define LP_GPIO_FUNC6_OUT_SEL    0x0000003FU
#define LP_GPIO_FUNC6_OUT_SEL_M  (LP_GPIO_FUNC6_OUT_SEL_V << LP_GPIO_FUNC6_OUT_SEL_S)
#define LP_GPIO_FUNC6_OUT_SEL_V  0x0000003FU
#define LP_GPIO_FUNC6_OUT_SEL_S  0
/** LP_GPIO_FUNC6_OUT_INV_SEL : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC6_OUT_INV_SEL    (BIT(6))
#define LP_GPIO_FUNC6_OUT_INV_SEL_M  (LP_GPIO_FUNC6_OUT_INV_SEL_V << LP_GPIO_FUNC6_OUT_INV_SEL_S)
#define LP_GPIO_FUNC6_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC6_OUT_INV_SEL_S  6
/** LP_GPIO_FUNC6_OE_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 6 of LP_GPIO_ENABLE_REG.
 */
#define LP_GPIO_FUNC6_OE_SEL    (BIT(7))
#define LP_GPIO_FUNC6_OE_SEL_M  (LP_GPIO_FUNC6_OE_SEL_V << LP_GPIO_FUNC6_OE_SEL_S)
#define LP_GPIO_FUNC6_OE_SEL_V  0x00000001U
#define LP_GPIO_FUNC6_OE_SEL_S  7
/** LP_GPIO_FUNC6_OE_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC6_OE_INV_SEL    (BIT(8))
#define LP_GPIO_FUNC6_OE_INV_SEL_M  (LP_GPIO_FUNC6_OE_INV_SEL_V << LP_GPIO_FUNC6_OE_INV_SEL_S)
#define LP_GPIO_FUNC6_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC6_OE_INV_SEL_S  8

/** LP_GPIO_FUNC7_OUT_SEL_CFG_REG register
 *  Configuration register for LP_GPIO7 output
 */
#define LP_GPIO_FUNC7_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2cc)
/** LP_GPIO_FUNC7_OUT_SEL : R/W; bitpos: [5:0]; default: 32;
 *  Configures to select a signal $Y (0 <= $Y < 32) from 32 peripheral signals to be
 *  output from LP_GPIO7.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  30: Select signal 30
 *  31: Select signal 31
 *  Or
 *  32: Bit 7 of LP_GPIO_OUT_REG and LP_GPIO_ENABLE_REG are selected as the output
 *  value and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define LP_GPIO_FUNC7_OUT_SEL    0x0000003FU
#define LP_GPIO_FUNC7_OUT_SEL_M  (LP_GPIO_FUNC7_OUT_SEL_V << LP_GPIO_FUNC7_OUT_SEL_S)
#define LP_GPIO_FUNC7_OUT_SEL_V  0x0000003FU
#define LP_GPIO_FUNC7_OUT_SEL_S  0
/** LP_GPIO_FUNC7_OUT_INV_SEL : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC7_OUT_INV_SEL    (BIT(6))
#define LP_GPIO_FUNC7_OUT_INV_SEL_M  (LP_GPIO_FUNC7_OUT_INV_SEL_V << LP_GPIO_FUNC7_OUT_INV_SEL_S)
#define LP_GPIO_FUNC7_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC7_OUT_INV_SEL_S  6
/** LP_GPIO_FUNC7_OE_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 7 of LP_GPIO_ENABLE_REG.
 */
#define LP_GPIO_FUNC7_OE_SEL    (BIT(7))
#define LP_GPIO_FUNC7_OE_SEL_M  (LP_GPIO_FUNC7_OE_SEL_V << LP_GPIO_FUNC7_OE_SEL_S)
#define LP_GPIO_FUNC7_OE_SEL_V  0x00000001U
#define LP_GPIO_FUNC7_OE_SEL_S  7
/** LP_GPIO_FUNC7_OE_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define LP_GPIO_FUNC7_OE_INV_SEL    (BIT(8))
#define LP_GPIO_FUNC7_OE_INV_SEL_M  (LP_GPIO_FUNC7_OE_INV_SEL_V << LP_GPIO_FUNC7_OE_INV_SEL_S)
#define LP_GPIO_FUNC7_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC7_OE_INV_SEL_S  8

/** LP_GPIO_CLOCK_GATE_REG register
 *  LP_GPIO clock gate register
 */
#define LP_GPIO_CLOCK_GATE_REG (DR_REG_LP_GPIO_BASE + 0x3f8)
/** LP_GPIO_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether or not to enable clock gate.
 *  0: Not enable
 *  1: Enable, the clock is free running.
 */
#define LP_GPIO_CLK_EN    (BIT(0))
#define LP_GPIO_CLK_EN_M  (LP_GPIO_CLK_EN_V << LP_GPIO_CLK_EN_S)
#define LP_GPIO_CLK_EN_V  0x00000001U
#define LP_GPIO_CLK_EN_S  0

/** LP_GPIO_DATE_REG register
 *  LP_GPIO version register
 */
#define LP_GPIO_DATE_REG (DR_REG_LP_GPIO_BASE + 0x3fc)
/** LP_GPIO_DATE : R/W; bitpos: [27:0]; default: 38826048;
 *  Version control register.
 */
#define LP_GPIO_DATE    0x0FFFFFFFU
#define LP_GPIO_DATE_M  (LP_GPIO_DATE_V << LP_GPIO_DATE_S)
#define LP_GPIO_DATE_V  0x0FFFFFFFU
#define LP_GPIO_DATE_S  0

#ifdef __cplusplus
}
#endif
